@yfried 
hmm strange, it works for me with v1.0.5 and 1.10.5
```
➜  clusters git:(main) ?✗ terraform version
Terraform v1.9.8
on darwin_arm64
+ provider registry.terraform.io/astronomer/astro v1.0.5

Your version of Terraform is out of date! The latest version
is 1.10.5. You can update by downloading from https://www.terraform.io/downloads.html
➜  clusters git:(main) ?✗ terraform apply -auto-approve
astro_deployment.dedicated: Refreshing state... [id=cm6jz46o500bx01mdne2f8phy]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # astro_api_token.deployment_tokens["item1"] will be created
  + resource "astro_api_token" "deployment_tokens" {
      + created_at   = (known after apply)
      + created_by   = (known after apply)
      + description  = "API token with permissions to modify the deploymnt"
      + end_at       = (known after apply)
      + id           = (known after apply)
      + last_used_at = (known after apply)
      + name         = "test-deployment-token-item1"
      + roles        = [
          + {
              + entity_id   = "cm6jz46o500bx01mdne2f8phy"
              + entity_type = "DEPLOYMENT"
              + role        = "DEPLOYMENT_ADMIN"
            },
        ]
      + short_token  = (known after apply)
      + start_at     = (known after apply)
      + token        = (sensitive value)
      + type         = "DEPLOYMENT"
      + updated_at   = (known after apply)
      + updated_by   = (known after apply)
    }

  # astro_api_token.deployment_tokens["item2"] will be created
  + resource "astro_api_token" "deployment_tokens" {
      + created_at   = (known after apply)
      + created_by   = (known after apply)
      + description  = "API token with permissions to modify the deploymnt"
      + end_at       = (known after apply)
      + id           = (known after apply)
      + last_used_at = (known after apply)
      + name         = "test-deployment-token-item2"
      + roles        = [
          + {
              + entity_id   = "cm6jz46o500bx01mdne2f8phy"
              + entity_type = "DEPLOYMENT"
              + role        = "deployment admin 1"
            },
        ]
      + short_token  = (known after apply)
      + start_at     = (known after apply)
      + token        = (sensitive value)
      + type         = "DEPLOYMENT"
      + updated_at   = (known after apply)
      + updated_by   = (known after apply)
    }

  # astro_api_token.deployment_tokens["item3"] will be created
  + resource "astro_api_token" "deployment_tokens" {
      + created_at   = (known after apply)
      + created_by   = (known after apply)
      + description  = "API token with permissions to modify the deploymnt"
      + end_at       = (known after apply)
      + id           = (known after apply)
      + last_used_at = (known after apply)
      + name         = "test-deployment-token-item3"
      + roles        = [
          + {
              + entity_id   = "cm6jz46o500bx01mdne2f8phy"
              + entity_type = "DEPLOYMENT"
              + role        = "test"
            },
        ]
      + short_token  = (known after apply)
      + start_at     = (known after apply)
      + token        = (sensitive value)
      + type         = "DEPLOYMENT"
      + updated_at   = (known after apply)
      + updated_by   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
astro_api_token.deployment_tokens["item3"]: Creating...
astro_api_token.deployment_tokens["item1"]: Creating...
astro_api_token.deployment_tokens["item2"]: Creating...
astro_api_token.deployment_tokens["item3"]: Creation complete after 1s [id=cm6jz4soc00cp01mdixmz520w]
astro_api_token.deployment_tokens["item2"]: Creation complete after 1s [id=cm6jz4sp800bl01oz7sz13gaa]
astro_api_token.deployment_tokens["item1"]: Creation complete after 1s [id=cm6jz4sp900cr01mdziixk342]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
➜  clusters git:(main) ✗       
```